Revit 2027 API
ParameterTypeId.BoundaryParamPreset Property
 "State"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryParamPreset { get; }
Public Shared ReadOnly Property BoundaryParamPreset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryParamPreset {
	ForgeTypeId^ get ();
}
static member BoundaryParamPreset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace